nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
/*
    App Gsm uart
*/

#include <rtthread.h> 
#include <rthw.h>
#include "stm32f4xx.h"
#include "usart.h"
#include "board.h"
#include <serial.h>

#include  <stdlib.h>//数字转换成字符串
#include  <stdio.h>
#include  <string.h>
#include  <ctype.h>
#include  <stdlib.h>
#include  <stdarg.h>
#include "App_moduleConfig.h" 


#define GSM_GPIO			GPIOC
#define GSM_TX_PIN			GPIO_Pin_10
#define GSM_TX_PIN_SOURCE	GPIO_PinSource10

#define GSM_RX_PIN			GPIO_Pin_11
#define GSM_RX_PIN_SOURCE	GPIO_PinSource11



#ifdef   M66_GSM



//----------  EM310 自带协议栈相关  -----------------------------
//   1.  通过命令和状态 初始化命令   
flash char  SIM_Check_Str[]="AT%TSIM\r\n";   //  检查SIM卡的存在
flash char  IMSI_Check_str[]="AT+CIMI\r\n";   
flash char  Signal_Intensity_str[]="AT+CSQ\r\n";  // 信号强度 ，常用
flash char  CommAT_Str1[]="ATV1\r\n";
flash char  CommAT_Str2[]="ATE0\r\n";
flash char  CommAT_Str3[]="AT+COPS?\r\n";  
flash char  CommAT_Str4[]="AT%SNFS=0\r\n";           // 设置音频输出通道选择 第二路
flash char  CommAT_Str5[] ="AT%NFI=0,10,0,0\r\n";  // 设置音频输入通道 选择第一路      
flash char  CommAT_Str6[] ="AT\r\n";  
flash char  CommAT_Str7[]="AT%NFV=5\r\n";  // 扬声器设置  --没有音频功放 没用
flash char  CommAT_Str8[]="AT%NFO=1,3,0\r\n";//;"AT%RING=1\r\n";   //开启铃音
flash char  CommAT_Str9[]="AT%VLB=1\r\n";//ATI
flash char  CommAT_Str10[]="AT%NFW=1\r\n";    //   保存音频设置
flash char  CommAT_Str11[]="AT+CGMR\r\n";//"AT%RECFDEL\r\n";//"AT\r\n"; //   
flash char  CommAT_Str12[]="AT+CMGF=1\r\n"; 
flash char  CommAT_Str13[]="AT+CPMS=\"SM\",\"SM\",\"SM\"\r\n";   
flash char  CommAT_Str14[]="AT+CNMI=2,1\r\n"; 
flash char  CommAT_Str15[]="AT+CMGD=1,4\r\n"; 



//    2.   通信模块登陆数据链路相关命令
flash char       DialInit1[]                          =    "AT+CREG?\r\n"; // "AT+CGACT=1,1\r\n"; S
flash char	DialInit2[]				=	"AT%IOMODE=1,2,1\r\n";	
flash char	DialInit3[]				=	"AT%ETCPIP=\"user\",\"gprs\"\r\n";	  
flash char	DialInit4[] 			       =	"AT%ETCPIP?\r\n";  
char	Dialinit_DNSR[50] 			=	"AT%DNSR=\"";     //  域名 up.gps960.com
char	Dialinit_DNSR2[50] 			=	"AT%DNSR=\"";     //  域名

flash char	DialInit6[] 			       =	"AT\r\n";  
flash char	DialInit7[] 			       =	"AT\r\n";	 
flash char	DialInit8[] 			       =	"AT\r\n";//"AT+CGPADDR\r\n";     

flash char	Open_TCP[]="AT%ETCPIP=\"user\",\"gprs\"\r\n";	

static u8	Send_TCP[18]="AT%IPSENDX=1,\"";
static u8	Send_ISP[18]="AT%IPSENDX=2,\"";	
static u8	DialStr_Link1[90]="AT%IPOPENX=1,\"TCP\",\"";//"ATD*99***1#\r\n"; AT%IPOPENX=1,"UDP","117.11.126.248",7106
static u8   DialStr_LinkAux[50]="AT%IPOPENX=1,\"TCP\",\"";//"ATD*99***1#\r\n"; AT%IPOPENX=1,"UDP","117.11.126.248",7106
static u8	Dialinit_APN[40]="AT+CGDCONT=1,\"IP\",\"";		//CMNET\"\r\n"; 	 // oranges Access Point Name
static u8   DialStr_Link2[50]="AT%IPOPENX=2,\"TCP\",\""; //  Link2             



flash char  CutDataLnk_str1[]="AT%IPCLOSE=3\r\n";
flash char  CutDataLnk_str2[]="AT%IPCLOSE=2\r\n";
flash char  CutDataLnk_str3[]="AT%IPCLOSE=1\r\n";
flash char  CutDataLnk_str4[]="AT%IPCLOSE=5\r\n";
flash char  CutDataLnk_str5[]="ATH\r\n";     

#endif

//  M66  Rec voice
flash char VoiceRec_config[]="AT%RECCFG=\"AMR\",0\r\n";  // 设置录音格式和录音质量
flash char VoiceRec_start[]="AT%RECSTART=\"";  //at%recstart="test1.amr",10 
flash char VoiceRec_stop[]="AT%RECSTOP\r\n"; 	 // %RECSTOP: 10,6824
flash char  VoiceRec_getdata[]="AT%RECFGET=\"";          //at%recfget="test1.amr",100,100
flash char  VoiceRec_delFile[]="AT%RECFDEL\r\n";   //  AT%RECFDEL="test1.amr" 

//-------  struct  variables -------------
static GSM_POWER   GSM_PWR;  
static IMSI_GET       IMSIGet; 
COMM_AT               CommAT; 
DATA_DIAL             DataDial;  



ALIGN(RT_ALIGN_SIZE)
 u8     GSM_rx[GSMRX_SIZE];       
u16     GSM_rx_Wr=0;
u16     info_len=0;  

static GSM_typeBUF GSM_INT_BUFF;
static GSM_typeBUF GSM_RX_BUFF;

u8  GSM_AsciiTx[GSM_AsciiTX_SIZE];
u16   GSM_AsciiTx_len=0; 

//-----  1 s timer  related below   ------
u16   one_second_couner=0;  
u8     Enable_UDP_sdFlag=0;      
 

u8    Dial_jump_State=0;  // 拨号过程中  状态跳转标志， DialInit5  DialInit6 到 DialInit7 的跳转标记
u8    Dnsr_state=0;  //  DNSR 状态   1: 表示在域名解析成功的前提下


//------- GPPRS 功能相关 ----------------
//u8 Datalink_close=0;  //挂断后不再登陆



//-------- TCP2 send ---------
u8     TCP2_ready_dial=0;
u16    Ready_dial_counter2=0;
u16    TCP2_notconnect_counter=0;
u8     TCP2_Connect=0;
u8	  TCP2_sdFlag=0;		//定时发送GPS位置信息标志
u16    TCP2_sdDuration=50; 
u8      TCP2_Coutner=0;  // 定时器计数
u8      TCP2_login=0;       // TCP 建立好连接后的标志位
u8       Online_error_counter=0;   // 登网或在线情况下,连续出现错误计数器     


//    TTS   相关
 TTS              TTS_Var;  //  TTS 类型变量
 ALIGN(RT_ALIGN_SIZE)
 u8                AT_TTS[1024];
 u16               TTS_Len=0;	 


//  Voice  Record 
VOC_REC       VocREC;    // 录音上传相关      

 

static void GSM_Process(u8 *instr, u16 len);
u32 GSM_HextoAscii_Convert(u8*SourceHex,u16 SouceHexlen,u8 *Dest);   

//   VOICE  RECORD   
void  VOC_REC_Init(void)
{


}

void VOC_REC_timer(void)
{



}

void VOC_REC_getinfolen(u8 *instr)    // when  get   %RECSTOP: 10,6824
{
     u8 i=0;
	 
   	if(VocREC.Sate==VOICEREC_RECORDING)   //%RECSTOP: 10,6824
    	{
              for(i=0;i<20;i++)   //  从前20个字节中找第一个,
		{
			if(instr[i]==',')
				break;
		} 
	      sscanf(instr+i+1, "%u", (u32*)&VocREC.filesize);
	      rt_kprintf("\r\n   VoiceFile Size: %d Bytes",VocREC.filesize);

               VocREC.Sate=VOICEREC_DataRXing;
	        VocREC.ExcuteFlag=1;  
		 VocREC.file_read=0;   // clear  
    	} 
	
}

void VOC_REC_process(void)
{
      u16 str_wr=0;
	  
  if(VocREC.running==1)
  {
        
      switch(VocREC.Sate)
      {
           case VOICEREC_RECORDING:   
		   	                                     if( 1==VocREC.ExcuteFlag)
							           {  
							                    //  1 .   get name ,  clear df  area  , write multimedia index 
							                    DF_LOCK=enable; 
										memset(VocREC.file_name,0,sizeof(VocREC.file_name)); 	    									
										sprintf((char*)VocREC.file_name,"%d%d%d%d.amr",time_now.day,time_now.hour,time_now.min,time_now.sec);    
										Api_DFdirectory_Delete(voice);   //clear  voice  DF  area 
										rt_kprintf("\r\n			录音文件名称: %s \r\n",VocREC.file_name);	
										Save_MediaIndex(1,VocREC.file_name,0,0);     
										memset(VocREC.SendString,0,sizeof((const char*)VocREC.SendString));
										str_wr=strlen((const char*)VoiceRec_start);
										memcpy(VocREC.SendString,VoiceRec_start,str_wr); 
										//-------------------------------
										memcpy(VocREC.SendString+str_wr,VocREC.file_name,strlen((const char*)VocREC.file_name));
										str_wr+=strlen((const char*)VocREC.file_name);
										memcpy(VocREC.SendString+str_wr,"\",6\r\n",5);//  5s  voice  data       
                                                                      str_wr+=5;
										// debug
										rt_kprintf("\r\n %s",VocREC.SendString); 
										rt_hw_gsm_output((const char*)VocREC.SendString);   										

										 VocREC.ExcuteFlag=0;  
							            }
								   
								  break;
	    case  VOICEREC_DataRXing:   
			                                   if( 1==VocREC.ExcuteFlag)
							       {    
							              if(VocREC.filesize>VocREC.file_read)
							              { 
							                   	memset(VocREC.SendString,0,sizeof((const char*)VocREC.SendString));
										str_wr=strlen((const char*)VoiceRec_getdata);
										memcpy(VocREC.SendString,VoiceRec_getdata,str_wr); 
										//-------------------------------
										memcpy(VocREC.SendString+str_wr,VocREC.file_name,strlen((const char*)VocREC.file_name));
										str_wr+=strlen((const char*)VocREC.file_name);
										memcpy(VocREC.SendString+str_wr,"\",",2);
									       str_wr+=2;
										sprintf(VocREC.SendString+str_wr,"%d,256\r\n",VocREC.file_read);//  get 512 bytes from current offset
										// debug
										rt_kprintf("\r\n %s",VocREC.SendString); 

										rt_hw_gsm_output((const char*)VocREC.SendString);      
										
										 VocREC.ExcuteFlag=0;  	  
							              } 
									 
