nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
							        }
								   
			                                     break;
           case  VOICEREC_DEL:
		   	                                   if( 1==VocREC.ExcuteFlag)
							             {
							           	       memset(VocREC.SendString,0,sizeof((const char*)VocREC.SendString));
										str_wr=strlen((const char*)VoiceRec_delFile);
										memcpy(VocREC.SendString,VoiceRec_delFile,str_wr);  
										//memcpy(VocREC.SendString+str_wr,VocREC.file_name,strlen((const char*)VocREC.file_name));
										//str_wr+=strlen((const char*)VocREC.file_name);
										//memcpy(VocREC.SendString+str_wr,"\"\r\n",3);

										// debug
										rt_kprintf("\r\n %s",VocREC.SendString); 
										
										rt_hw_gsm_output((const char*)VocREC.SendString); 

										  VocREC.ExcuteFlag=0;  
										  VocREC.Sate=VOICEREC_IDLE; 
							           	}
								   
			                                     break;		
    	    case  VOICEREC_IDLE:
	   	                                            break;
											 
	   

      	} 
  }
}

void VOC_REC_dataGet(u8 *instr )
{
    u16  i=0,commer=0;//,j=0;
    u16  HEX_len=0,len=0;	
    u8   pic_buf[550]; 
	
   	if(VocREC.Sate==VOICEREC_DataRXing)  //%RECFGET: 6624,"0E360C764009 
    	{
              for(i=0;i<20;i++)   //  从前20个字节中找第一个"
		{
		      if(instr[i]==':')
			  	commer=i;
			if(instr[i]=='"')
				break;
		} 
		  sscanf(instr+commer+1, "%d", (u32*)&len); 
		  rt_kprintf("\r\n Rxlen=%d bytes\r\n     ",len); 
		  
            //  for(j=0;j<(len<<1);j++)
		  //          rt_kprintf("%c",instr[i+1+j]);     
		 if(VocREC.half_page==0)	  
		      {   HEX_len= GSM_AsciitoHEX_Convert(instr+i+1,(len<<1),VocREC.HEX);  VocREC.half_page=1;}	 
		else 
		 	{   HEX_len= GSM_AsciitoHEX_Convert(instr+i+1,(len<<1),VocREC.HEX+256);  VocREC.half_page=0;}
		
		 if(HEX_len!=len)
		 	    rt_kprintf("\r\n  voice  ASCII to HEX error!\r\n");

		  VocREC.file_read+=HEX_len;	 //  add 
 
		  if((VocREC.half_page==0) ||(VocREC.file_read>=VocREC.filesize))	 
		  {
			 //  write and  check
	                 DF_WriteFlashDirect( VocREC.curren_PageCNT,0,VocREC.HEX, 512); // 写一次一个Page 512Bytes
			   rt_kprintf(" \r\n ---- write  voice_current_page=%d  \r\n",VocREC.curren_PageCNT);      
	                         //---  read compare 
			    memset(pic_buf,0,sizeof(pic_buf)); 
			    DF_ReadFlash(VocREC.curren_PageCNT,0,pic_buf, 512);      
			    for(i=0;i<512;i++)
			   {		if(pic_buf[i]!=VocREC.HEX[i])
			    	       {
			    	             rt_kprintf(" \r\n ----read not equal write  where i=%d  \r\n",i);  
						break;		 
			    	        }
			    }	                 
	                //------------   			
			 VocREC.curren_PageCNT++;
		  }		  	
					
		 if(VocREC.file_read>=VocREC.filesize)
		 {    //   最后一包
                       //--------------------------
                       VocREC.curren_PageCNT=SoundStart_offdet;
			  memset(pic_buf,0,sizeof(pic_buf)); 
                       memcpy(pic_buf,(u8*)&VocREC.filesize,4);	  // filesize 
                       HEX_len=strlen((const char*)VocREC.file_name); // get filename len
			  memcpy(pic_buf+4,VocREC.file_name,HEX_len);			  
			  DF_WriteFlashDirect(SoundStart_offdet,0,pic_buf, 25);   //  4+20  1 (null)
			  DF_delay_ms(10); 			   
                      //--------------------------------------------------------------------------                  
	               rt_kprintf("\r\n        VoiceFileSize: %d Bytes\r\n   \r\n",VocREC.file_read); 
                      //-------------------------------------------------------------------------- 
                      VocREC.Sate=VOICEREC_DEL;  // 删除文件  
		        VocREC.ExcuteFlag=1;  
			 VocREC.file_read=0;   // clear  
                        DF_LOCK=disable; 
			 //   开始准备上传 录音
			  Sound_send_start(); //开始上传
			 //--------------------------------------------------------------------------
		  }
               else
               {
	               VocREC.Sate=VOICEREC_DataRXing; 
		        VocREC.ExcuteFlag=1;   
               } 
    	} 
       else
	   	 rt_kprintf("\r\n Other VocREC.Sate=%d\r\n",VocREC.Sate);    


}

void VOC_REC_Stop(void)     //  录音结束
{




}

void  VOC_REC_filedel(void)
{
   //  if(VocREC.Sate==VOICEREC_DEL)
	// 	           VocREC.Sate=VOICEREC_IDLE;
 
}

 void VOC_REC_Start(void)    // 录音开始
 { 
     if(GSM_PWR.GSM_power_over)     //  必须模块ON 起来才能操作
     {
             if(VocREC.running==0)      //  若正在处理中，不处理    
		{											   
			VocREC.running=1;  								
			VocREC.JT808_Duration=(UDP_HEX_Rx[14]<<8)+UDP_HEX_Rx[15];
			VocREC.JT808_SaveOrNot=UDP_HEX_Rx[16];
			VocREC.Sate=VOICEREC_RECORDING; 
			VocREC.ExcuteFlag=1;   
			VocREC.curren_PageCNT=SoundStart_offdet+1;  // clear    // 第一个page 留着最后写语音信息用，空着先
	              VocREC.half_page=0; 
		}
     	}			 
 }
FINSH_FUNCTION_EXPORT(VOC_REC_Start, voice recrod);
//=========================================================================
//    TTS  realated
u8    TTS_Get_Data(u8 *Instr,u16 LEN)     //  return   0   : OK     return   1 : busy
{
     // 1. check status 
   if(TTS_Var.Playing)
   	{
           memset(TTS_Var.HEX_BUF,0,sizeof((const char*)TTS_Var.HEX_BUF));
          TTS_Var.HEX_len=LEN;
	    memcpy(TTS_Var.HEX_BUF,Instr,LEN);		
           TTS_Var.Save=1;  
	    rt_kprintf("\r\n   播报中,来信息存储\r\n"); 	   
   	    return  TTS_BUSY;
   	}  	
    //  2.   HEX to  ASCII convert 
     memset(TTS_Var.ASCII_BUF,0,sizeof((const char*)TTS_Var.ASCII_BUF));
     TTS_Var.ASCII_Len=GSM_HextoAscii_Convert(Instr,LEN,TTS_Var.ASCII_BUF);
     TTS_Var.ASCII_Len=(LEN<<1);// 长度乘以 2	 
     //  3. cacu  timeout value
     TTS_Var.TimeOut_limt=LEN/3+3;  // 3个字每秒+ 3  秒保护时间
     TTS_Var.TimeCounter=0;
     //  4.  ready to play
	TTS_Var.NeedtoPlay=1;	 
    return  TTS_OK;
}
u8    TTS_Data_Play(void) 
{
       u16   i=0;
	//  1.  check status  
      if(TTS_Var.Playing)
              return  TTS_BUSY;
      else
	if(TTS_Var.Save)  //  2.  check  save  status
	{      
	      TTS_Var.Save=0;
	     //  3. HEX to  ASCII	  
	     memset(TTS_Var.ASCII_BUF,0,sizeof((const char*)TTS_Var.ASCII_BUF));
	     TTS_Var.ASCII_Len=GSM_HextoAscii_Convert(TTS_Var.HEX_BUF,TTS_Var.HEX_len,TTS_Var.ASCII_BUF);
           TTS_Var.ASCII_Len=(TTS_Var.HEX_len<<1);// 长度乘以 2	 
	     //  4. cacu  timeout value
	     TTS_Var.TimeOut_limt=TTS_Var.HEX_len/3+3;  // 3个字每秒+ 3  秒保护时间
	     TTS_Var.TimeCounter=0;
	     //  5.  ready to play
		TTS_Var.NeedtoPlay=1;        
	}
       	
      //   6.   play process
      if( TTS_Var.NeedtoPlay	==1)
      	{
      	  Speak_ON;   // 开功放
      	   TTS_Var.Playing=1;
           //  head
           memset(AT_TTS,0,sizeof(AT_TTS));  
	    strcat(AT_TTS,"AT%TTS=2,3,6,\""); 
	    TTS_Len=strlen(AT_TTS)	;	      
	   //  info		 
	     memcpy(AT_TTS+TTS_Len,TTS_Var.ASCII_BUF,TTS_Var.ASCII_Len);	
	     TTS_Len+=TTS_Var.ASCII_Len; 
	   //  tail	 
	      memcpy((char*)AT_TTS+TTS_Len,"\"\r\n",3);    // tail 	 
            TTS_Len+=3;     	 
	        
	    for(i=0;i<TTS_Len;i++)
			 rt_kprintf("%c",AT_TTS[i]);   

	   rt_hw_gsm_output_Data(AT_TTS,TTS_Len);	

