nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
  //------ WatchDog --
   WatchDog_Feed();  //  Task Idle Hook 相关
      
  //-----  AT -----------
  memset(&AT,0,sizeof(AT));
  info_len=0;
  DataLink_EndFlag=0;  
  DataLink_end_counter=0;
  DataConnect_counter=0;		 //  在没有登网前重拨次数限制计数器    11-3-4 补加的 ERROR 20 
     
    
  //----- UDP ------------
  UDP_sdFlag=0;		  //定时发送GPS位置信息标志
  UDP_sdDuration=10; 
  UDP_Connect=0; 	  
#endif
}

 void  Total_Satus_Initial(void)
{
     Gsm_RegisterInit();   
} 


/* write one character to serial, must not trigger interrupt */
 void rt_hw_gsm_putc(const char c)
{
	/*
		to be polite with serial console add a line feed
		to the carriage return character
	*/
	//if (c=='\n')rt_hw_gps_putc('\r');	  
	//USART_SendData(UART4,  c);  
	//while (!(UART4->SR & USART_FLAG_TXE));   
	//UART4->DR = (c & 0x1FF);   
       	USART_SendData( UART4, c );
		while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )  
		{
		}
	
}

void rt_hw_gsm_output(const char *str)
{
     u16  len=0;
	/* empty console output */
	//--------  add by  nathanlnw ---------
	
     while (*str) 
	{
		rt_hw_gsm_putc (*str++);
	}
	
	/* len=strlen(str);
       while( len )
	{
		USART_SendData( UART4, *str++ );	
		while (!(UART4->SR & USART_FLAG_TXE));  
		UART4->DR = (*str++ & 0x1FF);   
		len--;
	}  */
       //--------  add by  nathanlnw  --------	
}

void rt_hw_gsm_output_Data(u8 *Instr,u16 len)  
{
      unsigned int  infolen=0;

	  infolen=len;

	  //--------  add by  nathanlnw ---------
       while (infolen)
	{
		rt_hw_gsm_putc (*Instr++);
		infolen--;
	}
       //--------  add by  nathanlnw  --------	

}
void Dial_Stage(T_Dial_Stage  Stage)
{	// set the AT modem stage
	//if (DataDial.Dial_step == Stage) return;	// no change    
									//
	DataDial.Dial_step = Stage;				//
	DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;
	DataDial.Dial_step_Retry=0;
}
void  GSM_RxHandler(u8 data)
{
    static u8  former_byte=0;
   		if( ( data == 0x0a ) && ( former_byte == 0x0d ) ) /*遇到0d 0a 表明结束*/
		{
			GSM_INT_BUFF.gsm_content[GSM_INT_BUFF.gsm_wr++] = data;
			if( GSM_INT_BUFF.gsm_wr < 1400 )
			{
				rt_mq_send( &mq_GSM, (void*)&GSM_INT_BUFF, GSM_INT_BUFF.gsm_wr+ 2 );
			}
			GSM_INT_BUFF.gsm_wr = 0;
		}else
		{
			GSM_INT_BUFF.gsm_content[GSM_INT_BUFF.gsm_wr++] = data;    
			if( GSM_INT_BUFF.gsm_wr == GSM_TYPEBUF_SIZE )
			{
				GSM_INT_BUFF.gsm_wr = 0;
			}
			GSM_INT_BUFF.gsm_content[GSM_INT_BUFF.gsm_wr ]=0;  
		}
		former_byte = data;

  
	  
}

void  GSM_Buffer_Read_Process(void)
{
      char ch;  
//-----------------------------------------------------
	rt_err_t	res;

	{
		res = rt_mq_recv( &mq_GSM,(void*)&GSM_RX_BUFF, 1400, RT_TICK_PER_SECOND / 20 ); //等待100ms,实际上就是变长的延时,最长100ms
		if( res == RT_EOK )                                                     //收到一包数据
		{
				GSM_Process(GSM_RX_BUFF.gsm_content, GSM_RX_BUFF.gsm_wr); 
		}
	}

}
//------------------------  ASCII    HEX  convert   ---------------------
u8  HexValue (u8 inchar) 
{
     switch(inchar)
     	{     	    
		   case '0':
                       return  0;
		   case '1': 
		   	           return  1;
		   case '2':
		   	           return  2;
	         case '3':
		   	           return  3;
		   case '4':
		   	           return  4;
		   case '5':    
		   	           return 5;
		   case '6':   
		   	           return 6;
		   case '7':
		   	            return 7;
		   case '8':     
		   	            return 8;
		   case '9':   
		   	           return 9;
		   case 'A':
		   	            return 0x0A;
		   case 'B':   

		   	            return 0x0B;
		   case 'C':
		   	            return 0x0C;
		   case 'D':    
		   	             return 0x0D;
		   case 'E': 
		   	            return 0x0E;
		   case 'F':    
		   	             return 0x0F;
		   default :
		   	           rt_kprintf("\r\n 转义有错误:%c \r\n",inchar);    
				    return  0xFF;
     	}
}
//------------------------------- HEX to ASCII --------------------------------------
u32 GSM_HextoAscii_Convert(u8*SourceHex,u16 SouceHexlen,u8 *Dest)   
{
  u16 len_counter=0;
  u16 dest_counter=0;  
  u8  c=0;

  for(len_counter=0;len_counter<SouceHexlen;len_counter++)   
  {
     c=SourceHex[len_counter];

	//---------------- High -------------------------------- 
    if((c>>4)>=10)
       Dest[dest_counter++]='A'+(c>>4)-10;
	else
	   Dest[dest_counter++]='0'+(c>>4);
	
    Dest[dest_counter]=0x00;

	//----------------- Low --------------------------------
	c=c&0x0F;
    if(c>=10)  
       Dest[dest_counter++]='A'+c-10;
	else 
	   Dest[dest_counter++]='0'+c; 
	Dest[dest_counter]=0x00;
  }
  
 return dest_counter; 
}
 u16  GSM_AsciitoHEX_Convert(u8 *Src_str,u16 Src_infolen,u8* Out_Str) 
 {
   u16 Counter=0,Out_Str_Len=0;
   u8  C=0;
	 
   Out_Str_Len=0;

     if((u8)Src_infolen&0x01)
   	{
   	     rt_kprintf("\r\n      接收ASCII信息不正确!   %u  \r\n",Src_infolen);     
   	}
   	
   for(Counter=0;Counter<Src_infolen;Counter++) 
   {   
        //--------------------------------------------------
           if((Counter&0x01)==1)
           	{
	           	 C=HexValue(*(Src_str+Counter));
			 if(C!=0xff)		 
	              {  
	                 Out_Str[Out_Str_Len]+=C;
	                 Out_Str_Len++; 
			  }	
			  else 
			  	  rt_kprintf("\r\n    Convert Error at:   %u  \r\n",Counter);    
           	}
	   else
		{
		     C=((HexValue(*(Src_str+Counter)))<<4);
                      Out_Str[Out_Str_Len]=(HexValue(*(Src_str+Counter)))<<4;	
		      if(C!=0xff)		 
	               {  
	                 Out_Str[Out_Str_Len]=C;
			  }	
			  else 
			  	  rt_kprintf("\r\n    Convert Error at2:   %u  \r\n",Counter);    			  
	   	}

   } 
	return Out_Str_Len;

 } 



void  Data_Send(u8* DataStr, u16  Datalen,u8  Link_Num)
{
    u16  i=0,packet_len=0;
     //  4. Send  


    //  4.1  发送要发送的信息长度  
	  memset(GSM_AsciiTx,0,sizeof(GSM_AsciiTx));	  
	 if(Link_Num==0)
	 {
	     strcat((char*)GSM_AsciiTx,Send_TCP);        // head
	     packet_len=strlen((const char*)Send_TCP);  
	 }
	 else
	 {
	     strcat((char*)GSM_AsciiTx,Send_ISP);        // head
	     packet_len=strlen((const char*)Send_ISP);   
	 }
         //  infomation 
          WatchDog_Feed();
         GSM_AsciiTx_len=GSM_HextoAscii_Convert( DataStr,Datalen,GSM_AsciiTx+packet_len);
	    packet_len+=GSM_AsciiTx_len;	  
           strcat((char*)GSM_AsciiTx,"\"\r\n");    // tail 	
           WatchDog_Feed();
	  packet_len+=3;
	  
    // 4.2 发送信息内容1
  //   if(DispContent==2)
	 {
	    for(i=0;i<packet_len;i++)
			 rt_kprintf("%c",GSM_AsciiTx[i]);     
	 }
        rt_hw_gsm_output_Data(GSM_AsciiTx,packet_len);	
        WatchDog_Feed();
        rt_thread_delay(RT_TICK_PER_SECOND/10);//DF_delay_ms(100);    

