nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
    //----------  Total_initial ------------
   if(CommAT.Total_initial==1)
   {
	 if( CommAT.Execute_enable)
	 {
	   switch(CommAT.Initial_step)
		   {
			 case 0:
					 rt_hw_gsm_output(CommAT_Str1);  
					 if(DispContent)
					 rt_kprintf(CommAT_Str1);  
					 CommAT.Initial_step++;
					 break;
			 case 1:
					 rt_hw_gsm_output(CommAT_Str2);
					 if(DispContent)
					 rt_kprintf(CommAT_Str2); 
					 CommAT.Initial_step++;
					 break;
   
			 case 2:/* Query Operator */
					 rt_hw_gsm_output(CommAT_Str3);  //"AT+COPS?\r\n"
					 if(DispContent)
					 rt_kprintf(CommAT_Str3);  
					// CommAT.Initial_step++;   
					 break;
			 case 3:
					 rt_hw_gsm_output(CommAT_Str4);  
					 if(DispContent)
					 rt_kprintf(CommAT_Str4);	
					 CommAT.Initial_step++;
					 break;
			 case 4:
					 rt_hw_gsm_output(CommAT_Str5);
					 if(DispContent)
					 rt_kprintf(CommAT_Str5);   
					 CommAT.Initial_step++;
					 break;
			 case 5:
					 rt_hw_gsm_output(CommAT_Str6);    
					 if(DispContent)
					 rt_kprintf(CommAT_Str6); 
					 CommAT.Initial_step++; 
					 break;
			 case 6:
					 rt_hw_gsm_output(CommAT_Str7);  
					 if(DispContent)
					 rt_kprintf(CommAT_Str7); 
					 CommAT.Initial_step++;
					 break;
			 case 7:	
					 rt_hw_gsm_output(CommAT_Str11); 
					 if(DispContent)
					 rt_kprintf(CommAT_Str11);  
					 CommAT.Initial_step++;
					 break;		
			 case 8:
					 rt_hw_gsm_output(CommAT_Str9);  
					 rt_kprintf(CommAT_Str9); 
					 CommAT.Initial_step++; 
					 break;	 		 
			 case 9:
					 rt_hw_gsm_output(CommAT_Str10);   
					 if(DispContent)
					 rt_kprintf(CommAT_Str10); 
			 
					 CommAT.Initial_step++;
					 break; 	
			 case 10:
					 rt_hw_gsm_output(VoiceRec_config);    //  配置语音录音参数
					 if(DispContent)
					 rt_kprintf(VoiceRec_config);  
					 CommAT.Initial_step++;
					 break;		 
                      case 11:
					 rt_hw_gsm_output(CommAT_Str12);  
					 if(DispContent)
					 rt_kprintf(CommAT_Str12);
					 CommAT.Initial_step++;
					 break; 
			 case 12:
					 rt_hw_gsm_output(CommAT_Str13);
					 if(DispContent)
					 rt_kprintf(CommAT_Str13); 
					 CommAT.Initial_step++;
					 break; 		 
			 case 13:
					 rt_hw_gsm_output(CommAT_Str14);
					 if(DispContent)
					 rt_kprintf(CommAT_Str14);  
					 CommAT.Initial_step++;
					 break; 	
			 case 14:
					 rt_hw_gsm_output(CommAT_Str15); 
					 rt_kprintf(CommAT_Str15);   
					 CommAT.Initial_step++;
					 break; 	
			 case 15://  信号强度 /		
			                rt_hw_gsm_output(Signal_Intensity_str); 
					 rt_kprintf(Signal_Intensity_str);    
					 break;
	               case 16:/*开始能拨号*/ 
					 rt_kprintf("AT_Start\r\n");   
					 CommAT.Initial_step=0; 
					 CommAT.Total_initial=0;   

					 DataDial.Dial_ON=enable;  //  进入  Data   状态
					 DataDial.Pre_Dial_flag=1;    // Convert to  DataDial State
					 Dial_Stage(Dial_DialInit0);     		  			 
					 break; 				 
			 default:					  
					break;
	 
		   }  
	    CommAT.Execute_enable=0;
	 }
   } 

}

void Redial_Init(void)
{
        //----------- Data Dial ----------------
   memset((u8*)&DataDial,0,sizeof(DataDial)); 
   DataDial.start_dial_stateFLAG=1; //important 
   DataDial.Dial_ON=enable;  //  进入  Data   状态
   DataDial.Pre_Dial_flag=1;    // Convert to  DataDial State
   Dial_Stage(Dial_DialInit0);
}

void  Dial_step_Single_10ms_timer(void)  
{
      //    没在数据状态下，和 成功登陆上后不进行处理
     	if( (DataDial.Dial_ON==0)||(DataDial.Dial_step==Dial_Idle) )
		   return;				
    
		if (DataDial.Dial_step_RetryTimer>= 10)
			DataDial.Dial_step_RetryTimer -= 10;
		else
			DataDial.Dial_step_RetryTimer = 0;
}

void  Get_GSM_HexData(u8*  Src_str,u16 Src_infolen,u8 link_num)
{
     u16   i=0;
     //  1.  Check wether   Instr   is  need   to  convert     Exam:  ASCII_2_HEX	 
                GSM_HEX_len= GSM_AsciitoHEX_Convert(Src_str,Src_infolen,GSM_HEX); 
     //  2 .  Realse   sem
		App_rxGsmData_SemRelease(GSM_HEX, GSM_HEX_len,link_num); 
} 

void DataLink_Process(void)
{
   u8  len=0,i=0; 
   
  	// state  filter  1:   没在数据状态下，和 成功登陆上后不进行处理
     	if( (DataDial.Dial_ON==0)||(DataDial.Dial_step==Dial_Idle) ) 
		    return;				
	// state  filter  2:  	单步延时还没有到
       if (DataDial.Dial_step_RetryTimer ) 
	   	    return;						   // not time to retry
	// state  filter  3:      	    
        if (DataDial.Dial_step_Retry>= Dial_Step_MAXRetries)		
        {														  
			   //---------------------------------------			  
			   DataDial.Connect_counter++;
			   if( DataDial.Connect_counter>4)     
				   {
					   DataDial.Pre_Dial_flag=1; 	  //--- 重新拨号	
					   DataDial.Pre_dial_counter=0;
					   rt_kprintf("\r\n  RetryDialcounter>=4 重新拨号\r\n");  
				   }	 
			   Dial_Stage(Dial_DialInit0);    // Clear   from  Dial  start 	
			   DataDial.Dial_step_Retry=0;
			   DataDial.Dial_step_RetryTimer=0; 
			   rt_kprintf("\r\nDataDial.Dial_step_Retry>= Dial_Step_MAXRetries ,redial \r\n");
			   return;													   
	  } 
	  //----------  主连接重试2次 失败切换到辅连接	
        if((DataDial.Dial_step==Dial_MainLnk)&&(DataDial.Dial_step_Retry>2))
         {
              i=0;
              if(Dnsr_state)
              {
                   Dial_Stage(Dial_MainLnk);    // 如果是DNSR 连接那么换到mainlink
              }
		else
		{
                    // rt_thread_delay(10);
			rt_kprintf("Dial_MainLnk Retry>2 AT%IPCLOSE=1\r\n");		   
		       rt_hw_gsm_output("AT%IPCLOSE=1\r\n");    	
		       WatchDog_Feed();   
			delay_ms(100);//rt_thread_delay(10);
                     Dial_Stage(Dial_AuxLnk);    
			DataLink_AuxSocket_set(RemoteIP_aux, RemotePort_main,0);	 
		 
		}			 
         }
		
		

	 //  work  on 
       if(DataDial.Dial_ON)
       {
             switch(DataDial.Dial_step)
             	{
                   case Dial_DialInit0: 
				   	 rt_hw_gsm_output(DialInit1);
			               //-----------------------------------------
                                      DataDial.start_dial_stateFLAG=1;   
				         //-----------------------------------------
				         DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;
					  DataDial.Dial_step_Retry++;
					  //  Debug
 					  rt_kprintf(DialInit1);   
           
					break;
		      case Dial_DialInit1:    rt_hw_gsm_output((const char*)Dialinit_APN);
                                   DataDial.Dial_step_RetryTimer=Dial_max_Timeout; 
					DataDial.Dial_step_Retry++;
					 len=strlen((const char*)Dialinit_APN);
					for(i=0;i<len;i++)										
					         rt_kprintf("%c",Dialinit_APN[i]);     

				       break;			
		     case Dial_DialInit2:     rt_hw_gsm_output(DialInit2);
                                   DataDial.Dial_step_RetryTimer=Dial_Timeout;
					DataDial.Dial_step_Retry++;
					 len=strlen((const char*)DialInit2);
					for(i=0;i<len;i++)										
					         rt_kprintf("%c",DialInit2[i]);   

				       break;
		     case  Dial_DialInit3:  
			 	       rt_hw_gsm_output(DialInit3);
                                   DataDial.Dial_step_RetryTimer=Dial_max_Timeout; 
					DataDial.Dial_step_Retry++;
					 len=strlen((const char*)DialInit3);
					for(i=0;i<len;i++)										
					         rt_kprintf("%c",DialInit3[i]);      

				       break;			   
		     case Dial_DialInit4:    rt_hw_gsm_output(DialInit6); // AT
                                   DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;
					DataDial.Dial_step_Retry++;
					 len=strlen((const char*)DialInit6);
					for(i=0;i<len;i++)										
					         rt_kprintf("%c",DialInit6[i]);  

					break;
		     
		    case Dial_DialInit5:    rt_hw_gsm_output(DialInit4);
                                   DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time; 
					DataDial.Dial_step_Retry++;
					 len=strlen((const char*)DialInit4);
					for(i=0;i<len;i++)										
					         rt_kprintf("%c",DialInit4[i]);       

				       break;	
		    case Dial_DialInit6:    rt_hw_gsm_output(DialInit8);  // Query  IP 
                                   DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time; 
					DataDial.Dial_step_Retry++;
					 len=strlen((const char*)DialInit8);
					for(i=0;i<len;i++)										
					         rt_kprintf("%c",DialInit8[i]);     

				       break;	 	
		    case Dial_DNSR1:    rt_hw_gsm_output(Dialinit_DNSR);  // main DNSR
                                   DataDial.Dial_step_RetryTimer=Dial_max_Timeout; 
					DataDial.Dial_step_Retry++;
					rt_kprintf("\r\n   ----- Link  main  DNSR ----\r\n");
					 len=strlen((const char*)Dialinit_DNSR);
					for(i=0;i<len;i++)										
					         rt_kprintf("%c",Dialinit_DNSR[i]);     
                                   Dial_jump_State=7;
					Dnsr_state=1;//表示DNSR 状态下拨号 				   
				       break;	 
            case Dial_DNSR2:    rt_hw_gsm_output(Dialinit_DNSR2);  // Aux DNSR
                                   DataDial.Dial_step_RetryTimer=Dial_max_Timeout; 
					DataDial.Dial_step_Retry++;
					rt_kprintf("\r\n   ----- Link  Aux  DNSR ----\r\n");
					 len=strlen((const char*)Dialinit_DNSR2);
					for(i=0;i<len;i++)										
					         rt_kprintf("%c",Dialinit_DNSR2[i]);       
                                   Dial_jump_State=8; 
					Dnsr_state=1;//表示DNSR 状态下拨号 				   
				       break;	 					   
		    case Dial_DialInit7:    rt_hw_gsm_output(DialInit8);  // Query  IP 
                                   DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time; 
					DataDial.Dial_step_Retry++;
					 len=strlen((const char*)DialInit8);
					for(i=0;i<len;i++)										
					         rt_kprintf("%c",DialInit8[i]);     

				       break;	   
		     case Dial_MainLnk:   // rt_hw_gsm_output(DialStr_Link1); 
		                       if( Dnsr_state==0)//表示DNSR 状态下拨号 	 
		                       	{
		                       	   rt_kprintf("\r\n Dial  orginal   Mainlink\r\n");  
                                            DataLink_MainSocket_set(RemoteIP_main,RemotePort_main,1);
		                       	}
							   
                                   DataDial.Dial_step_RetryTimer=3000; 
					DataDial.Dial_step_Retry++;
					 len=strlen((const char*)DialStr_Link1); 
					 for(i=0;i<len;i++)										
					   {
					        rt_hw_gsm_putc (DialStr_Link1[i]);     
					   }	
					for(i=0;i<len;i++)										
					   {
					        rt_kprintf("%c",DialStr_Link1[i]);    
					   }		
					break; 
		      case Dial_AuxLnk:   // rt_hw_gsm_output(DialStr_Link2); 
                                   DataDial.Dial_step_RetryTimer=3000;
					DataDial.Dial_step_Retry++;
					 len=strlen((const char*)DialStr_LinkAux); 
					 for(i=0;i<len;i++)										
					   {
					        rt_hw_gsm_putc (DialStr_LinkAux[i]);     
					   }	
					for(i=0;i<len;i++)										
					   {
					        rt_kprintf("%c",DialStr_LinkAux[i]);     
					   }		
					break; 	
 		     case   Dial_ISP:
 				    DataDial.Dial_step_RetryTimer=Dial_max_Timeout;
					DataDial.Dial_step_Retry++;
					 len=strlen((const char*)DialStr_Link2); 
					 for(i=0;i<len;i++)										
					   {
					        rt_hw_gsm_putc (DialStr_Link2[i]);     
					   }	
				      rt_kprintf("\r\n   ----- Link  Isp----\r\n");       
					for(i=0;i<len;i++)										
					   {
					        rt_kprintf("%c",DialStr_Link2[i]);     
					   }	
					break;				
		      default:
			  	       break;
             	}

