nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
       }  



}

static void GSM_Process(u8 *instr, u16 len)
{
      	u8	ok = false;
		u8	error = false;
		u8	failed = false; 
		u8	connect = false;   		
        u16  i=0;//,len=0;//j=0;
       //  u8 reg_str[80]; 
//----------------------  Debug -------------------------		
  // if(DispContent==2)	 
   memset(GSM_rx,0,sizeof((const char*)GSM_rx));
   memcpy(GSM_rx,instr,len);
   if((ISP_running_state==0)) 
   {
       rt_kprintf("\r\n");      
        for(i=0;i<len;i++)  
		 rt_kprintf("%c",GSM_rx[i]);     	
   }

   //------------------------------------------------------------------------------------------------------------------- 
	if (strncmp((char*)GSM_rx, "AT-Command Interpreter ready",20) == 0)  
	{	
		 /*
				 模块重新启动了，有些状态要还原到相应状态 ，-- 需要做处理
		  */ 
		GSM_PWR.GSM_PowerEnable=0;      
		GSM_PWR.GSM_powerCounter=0;
		GSM_PWR.GSM_power_over=1;   
		rt_kprintf("\r\n  GSM 模块启动\r\n");         			
	}

	 if(strncmp((char*)GSM_rx,"%RECFGET: ",9)==0)  //%RECFGET: 6624,"0E360C764009
      	{
      	   //   rt_kprintf("\r\n  RECFGET len=%d\r\n",len);
      	      memcpy(VocREC.ASCII_in,GSM_rx,len); 
             VOC_REC_dataGet(VocREC.ASCII_in);    
	      goto RXOVER; 	 		
      	} 

       if(strncmp((char*)GSM_rx, "%IPDATA:2",9)==0)   // ISP 过来      
	{												   //exam:	%IPDATA:2,16,"6473616466617365"
              for(i=0;i<20;i++)   //  从前20个字节中找第一个"
		{
			if(GSM_rx[i]=='"')
				break;
		} 
		  info_len=(len-i-5);	 
		    rt_kprintf("\r\n infolen=%d  len=%d  i=%d\r\n",info_len,len,i);      
	        // Get_GSM_HexData(GSM_rx+i+1,info_len,1);      //  远程下载链路
	        //------------------------------------------------
	         UDP_hexRx_len= GSM_AsciitoHEX_Convert(GSM_rx+i+1,info_len,UDP_HEX_Rx); 
	         TCP_RX_Process(1);    
		//--------------------------------------------------	 
	         goto RXOVER; 
	 }	
	else    
	if(strncmp((char*)GSM_rx, "%IPDATA:1",9)==0) // UDP	  有数据过来了
	{												   //exam:	%IPDATA:1,16,"6473616466617365"
               for(i=0;i<20;i++)   //  从前20个字节中找第一个"
			{
				if(GSM_rx[i]=='"')
					break;
			} 
		  info_len=len-i-5;  	  
		//  rt_kprintf("\r\n  IPDATA 1 len=%d\r\n",info_len);   
		  WatchDog_Feed();
	         Get_GSM_HexData(GSM_rx+i+1,info_len,0);       
	         goto RXOVER; 	 
	 }     
	if(strncmp((char*)GSM_rx,"%RECSTOP:",9)==0)  //%RECSTOP: 10,6824
	{
             VOC_REC_getinfolen(GSM_rx);  
	         goto RXOVER; 	 		 
	}
	if(strncmp((char*)GSM_rx, "%TTS: 0",7)==0)
	{
                 TTS_Play_End();
		    rt_kprintf("\r\n   TTS  播放完毕\r\n");    		 
	}
	if(strncmp((char*)GSM_rx, "%IPSENDX:1",10)==0)	 // 链路 1  TCP 发送OK  
	{												   //exam:	%IPSENDX:1,15 
             Api_cycle_Update();  //  数据发送 ，更新写指针	   
	} 
	else
       if(strncmp((char*)GSM_rx, "%IPCLOSE: 2",11) == 0)// ISP close
	 {
		
		rt_kprintf("\r\n");
		rt_kprintf("%s",GSM_rx); 
		rt_kprintf("\r\n");
              #ifdef MULTI_LINK
		     TCP2_Connect=0;										   
		     TCP2_ready_dial=0;  
		     TCP2_login=0;  

              
		     if(DataLink_Status())
			 	  TCP2_ready_dial=1;         
		 #endif	 
        } 
	else
	if(strncmp((char*)GSM_rx, "IPCLOSE",5) == 0)    
	{
		 DataLink_Online=0;
		 ModuleStatus &=~Status_GPRS;
		 rt_kprintf("\r\n所有链接都关闭!\r\n");  
		 DataDial.Pre_Dial_flag=1;
		 //------  交互导航链接状态 ----------
		// ZHinfotype=ZH_01H;
		// subtype=0x2B;	  //  通知显示屏断开   
		 
	}
	else
	if(strncmp((char*)GSM_rx, "%IPCLOSE:",9) == 0)	  
	{
	   DataLink_Online=0;
		 ModuleStatus &=~Status_GPRS; 
		 rt_kprintf("\r\nTCP连接关闭!\r\n");	 
		 if(CallState==CallState_Idle)		 //  不要再通话的时候操作 
		 {	
		    rt_hw_gsm_output("ATH\r\n"); 		
			DataLink_EndFlag=1; 
			DEV_Login.Operate_enable=1;//重新鉴权
		 }
		 
	}	
      if(strncmp((char*)GSM_rx, "%DNSR:",6) == 0)
	{  //%DNSR:113.31.28.100
		//%DNSR:0.0.0.0 
		if(strncmp((char*)GSM_rx, "%DNSR:0.0.0.0",13) == 0)
		  {
		        rt_kprintf("\r\n   域名解析失败\r\n");    
			 if((Dial_jump_State==7)||(Dial_jump_State==8))
				Dial_jump_State=0;    
		        Dnsr_state=0;//表示DNSR 状态下拨号 			  

		  }	  
	        else
	        { 
	                     
	                    
				i =str2ip((char*)GSM_rx+6, RemoteIP_Dnsr);
				if (i <= 3) failed = true; 
			        //memcpy((char*)SysConf_struct.IP_Main,RemoteIP_main,4);
				 // SysConf_struct.Port_main=RemotePort_main;
				 //Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
			        DataLink_MainSocket_set(RemoteIP_Dnsr,RemotePort_main,1);
                             rt_kprintf("\r\n   域名解析成功\r\n"); 

				  Dial_Stage(Dial_MainLnk);  //--   切换到拨号    
				  return ;
		}
      	}
	else
	if(strncmp((char*)GSM_rx, "+COPS: 0,0,",11)==0)
	{ 
			//联通卡	   +COPS: 0,0,"CHN-CUGSM"
			//移动卡	   +COPS: 0,0,"CHINA  MOBILE"
			//注销的卡	  +COPS: 0
	  /*	if(strcmp((char*)GSM_rx, "+COPS: 0,0,\"CHN-CUGSM\"")==0)  
			{
				//联通的
				//memset((char *)Dialinit_APN,0,sizeof(Dialinit_APN));
				//strcat((char*)Dialinit_APN, "AT+CGDCONT=1,\"IP\",\"UNINET\"\r\n");  
			}
		  else
		  if(strcmp((char*)GSM_rx, "+COPS: 0,0,\"CHINA  MOBILE\"")==0)	
			{
			   // 移动的
				//memset(Dialinit_APN,0,sizeof(Dialinit_APN));
				//strcat(Dialinit_APN, "AT+CGDCONT=1,\"IP\",\"CMNET\"\r\n");
			} 
	  */
	  	if(strncmp((char*)GSM_rx+12, "CHINA UNICOM",12)==0)
	  	    {
			memcpy(APN_String,"UNINET",6);
            memset((u8*)SysConf_struct.APN_str,0 ,sizeof(SysConf_struct.APN_str));
            memcpy(SysConf_struct.APN_str,(u8*)APN_String,strlen((const char*)APN_String));  
            Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));       
				
			//联通的
			memset((char *)Dialinit_APN,0,sizeof(Dialinit_APN));
			strcat((char*)Dialinit_APN, "AT+CGDCONT=1,\"IP\",\"UNINET\"\r\n");  
			}
		else if(strncmp((char*)GSM_rx+12, "CHINA MOBILE",12)==0)	
			{
			memcpy(APN_String,"CMNET",5);
            memset((u8*)SysConf_struct.APN_str,0 ,sizeof(SysConf_struct.APN_str));
            memcpy(SysConf_struct.APN_str,(u8*)APN_String,strlen((const char*)APN_String));  
            Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));       
			
		   // 移动的
			memset(Dialinit_APN,0,sizeof(Dialinit_APN));
			strcat(Dialinit_APN, "AT+CGDCONT=1,\"IP\",\"CMNET\"\r\n");
			}
		   CommAT.Initial_step++; 
		 //-------------------------------------------------------------------------   
		   
			
