nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
	}  
	else
	if(strncmp((char*)GSM_rx, "+COPS: 0",8)==0)  //----该卡被注销了
	{
		COPS_Couter++;
		if(COPS_Couter>=3) 
		{
			COPS_Couter=0;
			CommAT.Initial_step++;   
			rt_kprintf("\r\n  SIM卡搜索不到网络\r\n"); 
		}
	}
	else
	if(strncmp((char*)GSM_rx, "OK",2) == 0)  
		{				
		    ok = true;
		  if(DispContent)	
			   rt_kprintf(" OK\r\n");     			
               			 //------------------------------------  
		   if(Send_Rdy4ok==1)
		   	{
		   	    Api_cycle_Update();
		         //  rt_kprintf("\r\n Updata cycle  status !! ----reg for debug\r\n");
			    Send_Rdy4ok=0;	   
		   	}		   
			//-------------------------------------------
		  VOC_REC_filedel();	
        }
	else
	if (strcmp((char*)GSM_rx, "NO DIALTONE") == 0) failed = true;
	else
	if (strcmp((char*)GSM_rx, "NO ANSWER") == 0) failed = true;
	if (strncmp((char*)GSM_rx, "NO CARRIER",10) == 0) 
	{                      //  NO CARRIER  
		 CallState=CallState_Idle;	
		  Speak_OFF;// 关闭功放 
		 failed = true;
		 rt_kprintf("\r\n Callstate=Idle\r\n");    
	}   
	if(strcmp((char*)GSM_rx, "BUSY") == 0)  
	{ 
		// ZHinfotype=ZH_01H;//  车台向终端发送振铃指示
		 //subtype=0x12;	   //挂断
		 CallState=CallState_Idle;	
		 failed = true; 
		// Off_speaker;		// 关闭功放 
		 //Clip_flag=0;
		 //Clip_counter=0; 
	
	}
	else
	if(strncmp((char*)GSM_rx,"+CSQ:",5)==0)	//场强信息
	{ //+CSQ: 27,99
				if ( GSM_rx[7] == ',' )
				{
						ModuleSQ = GSM_rx[6] - 0x30;   
				}
				else if ( GSM_rx[8] == ',' )
				{
						ModuleSQ = ( GSM_rx[6] - 0x30 ) * 10 + GSM_rx[7] - 0x30;
	
						if ( ModuleSQ == 99 )
						{
								ModuleSQ = 0;
						}
				}
	          //-------------------------------------- 
	 	      //  You must   register on 
	 		  if(CommAT.Total_initial==1)
	 			{
	                if(ModuleSQ>10)
	 				{
	 				  CommAT.Initial_step++;
					  rt_kprintf("\r\n CSQ check Pass\r\n");     
	                }
	 			} 				 
		
	}

	if (strncmp((char*)GSM_rx, "%TSIM",5) == 0)	 //-----  %TSIM 1 %TSIM 1
	{
	   if(GSM_rx[6]=='0')
		{
				  IMSIGet.imsi_error_count++;
				  if(IMSIGet.imsi_error_count>10) 
					{
					  IMSIGet.Get_state=2;
					  IMSIGet.imsi_error_count=0; 
					  GSM_PWR.GSM_power_over=0;;
					  IMSIGet.Get_state=0;
					 // EM310_StartFLAG=0;
					  rt_kprintf("\r\n没有检测到SIM卡\r\n"); 
					}	
		}
	   else
	   if(GSM_rx[6]=='1') 
		{
			IMSIGet.Get_state=1;
			rt_kprintf("\r\n  检测到SIM卡\r\n"); 
		}
	}	  
	else
	if (strncmp((char*)GSM_rx, "460",3) == 0)	//----- Nathan Add
	{
	  
	  CommAT.Total_initial=1;	// 进行参数配置
	  //---  add for Test  ----- 
	// memcpy(GSM_rx,"460021022612645",15);     // 河北平台车123         
	 //   memcpy(GSM_rx,"460013602069192",15);     // 河北平台车123       
	  //memcpy(GSM_rx,"460012212469640",15);     // 渝000000-lnw
	  //memcpy(GSM_rx,"460011031643452",15);     // 江工车台
	  rt_kprintf("\r\n获取IMSI 号码:%s \r\n",GSM_rx);       
	  memcpy((char*)IMSI_CODE,(char*)GSM_rx,15);
	  RTC_TimeShow();
	  IMSIGet.imsi_error_count=0;	
	  IMSIGet.Get_state=1;
	  GSM_PWR.GSM_power_over=2;     //  get imsi
	  IMSIGet.Get_state=0;
	  CommAT.Total_initial=1;	// 进行参数配置  	  	 
	}
	else
	if(strncmp((char*)GSM_rx,"RING",4)==0)  //电话  
	{
         ;	 
	}  
	else
	if ((strlen((char*)GSM_rx) >= 7) && (strncmp((char*)GSM_rx, "CONNECT", 7) == 0))
	{
	      connect=true;
	}
	if(strncmp((char*)GSM_rx,"ERROR: 13",9)==0)//ERROR:13
	{
	      Online_error_counter++;
		  if(Online_error_counter>3)	 
	         {   
	                rt_kprintf("\r\n  error 13  >3  disc\r\n");
	                DataLink_EndFlag=1; //AT_End();    
	                            Online_error_counter=0;
		  }

	}
      if(strncmp((char*)GSM_rx,"ERROR:13",8)==0)//ERROR:13  
	{
	      Online_error_counter++;
		  if(Online_error_counter>3)	 
	         {   
	                rt_kprintf("\r\n  error 13  >3  disc\r\n");
	                DataLink_EndFlag=1; //AT_End();    
	                            Online_error_counter=0;
		  }

	}
	else  //ERROR: 14 
	if((strncmp((char*)GSM_rx,"ERROR: 30",9)==0)||(strncmp((char*)GSM_rx,"ERROR: 20",9)==0)||(strncmp((char*)GSM_rx,"ERROR: 14",14)==0)||(strncmp((char*)GSM_rx,"ERROR: 19",14)==0)\
		||(strncmp((char*)GSM_rx,"ERROR: 6",8)==0)||(strncmp((char*)GSM_rx,"ERROR: 7",8)==0)||(strncmp((char*)GSM_rx,"ERROR: 8",8)==0)||(strncmp((char*)GSM_rx,"ERROR: 10",9)==0))	    
	{
		     if (Dial_jump_State==7)
				{  
				       rt_hw_gsm_output("AT%IPCLOSE=1\r\n");   
					rt_thread_delay(10);   
		                     Dial_Stage(Dial_DNSR1);  // 后边跳跃到ready to  connect aux DNS 
					  rt_kprintf("\r\n   DNSR1  解析 成功-->连接失败\r\n");   	
					   Dnsr_state=0;//表示DNSR 状态下拨号 	
				     	//-------------  End  need	process ---------------------------------------
			               memset(GSM_rx, 0, sizeof(GSM_rx));
	                             GSM_rx_Wr = 0;      
					 return;	   
				}
			       else	 
		             if(Dial_jump_State==8)    
				{      
				        rt_hw_gsm_output("AT%IPCLOSE=1\r\n");    
					 rt_thread_delay(10);
		                      Dial_Stage(Dial_MainLnk);  // ready to  connect mainlink
				        rt_kprintf("\r\n   DNSR2  解析 成功-->连接失败\r\n");  	
				        Dial_jump_State=0;  		
					 Dnsr_state=0;//表示DNSR 状态下拨号 		  
						//-------------  End  need	process ---------------------------------------
			               memset(GSM_rx, 0, sizeof(GSM_rx));
	                             GSM_rx_Wr = 0; 
					  return;	   	  
				}	
				else	 
				 if(DataDial.Dial_step ==Dial_MainLnk)    //mainlink  to  auxlink
				{      
				        // GSM_PutStr("AT%IPCLOSE=1\r\n");  
					//  AT_Stage(AT_Dial_AuxLnk);//AT_Dial_AuxLnk  
					 rt_thread_delay(10);
					 Dial_Stage(Dial_AuxLnk);//  ready to connect auxlink
					
				         //-----------  Below add by Nathan  ----------------------------
                                     DataLink_AuxSocket_set(RemoteIP_aux, RemotePort_main,0);	 
					 //-------------  End  need	process ---------------------------------------
			               memset(GSM_rx, 0, sizeof(GSM_rx));    
 	                             GSM_rx_Wr = 0;  
 					  return;	   
			    	}
				 //--------------------------------
				 else
				 {
				         Online_error_counter++;
					  if(Online_error_counter>3)	 
				         {   
				                DataLink_EndFlag=1; //AT_End();    
                                            Online_error_counter=0;
					  }	 
				 }        
	} 
	else
	if (strncmp((char*)GSM_rx, "ERROR",5) == 0) 
	{
	   error = true;
	   CallState=CallState_Idle;  
	   //----------------------
	   if(TTS_ACK_Error_Process()==true)
               {     rt_kprintf("\r\n  TTS ack  error \r\n");  Speak_OFF; }
	   else 
	   if(DataLink_Status())        //   Online  state  Error    , End Link and Redial    
	       {
	                   Online_error_counter++;
				  if(Online_error_counter>3)	 
			         {   
			                DataLink_EndFlag=1; //AT_End();    
	                              Online_error_counter=0;
				  }
			  rt_kprintf("\r\n Online error\r\n"); 	   
	   	}
	   rt_kprintf("\r\n ERROR\r\n");      
	}   
	else
	if (strncmp((char*)GSM_rx, "Unknown",7) == 0) 
		error = true;	

	//-------------  End  need	process ---------------------------------------
RXOVER:
       memset(GSM_rx, 0, sizeof(GSM_rx));
	GSM_rx_Wr = 0; 
	
