nathanlnw/Tw703_gghypt_TJ_local/bsp/stm32f407vgt6_RecDrv/app_712/gsm/Device_gsm.c
	//---------------------  Function  Process Below --------------------------
	if ((DataDial.Dial_step != Dial_MainLnk) && failed) 
	{ 
		 Dial_Stage(Dial_Idle); 
		return;
	}
	
	switch (DataDial.Dial_step)
	{
		case Dial_DialInit0:	if (ok)  Dial_Stage(Dial_DialInit1);
								break;
		case Dial_DialInit1   :   if (ok) Dial_Stage(Dial_DialInit2); 
								break;
		case Dial_DialInit2	:	if (ok)   Dial_Stage(Dial_DialInit3);
								break;
		case Dial_DialInit3	:	if (ok)   Dial_Stage(Dial_DialInit4);
								break;
		case Dial_DialInit4	:	if (ok)  Dial_Stage(Dial_DialInit5);
								break;
		case Dial_DialInit5	:	if (ok)  Dial_Stage(Dial_DialInit6);
								break;
		case Dial_DialInit6	:	if (ok)  
			                                   #ifdef MULTI_LINK
			                                         Dial_Stage(Dial_DNSR1);   // 多连接
								#else
								      Dial_Stage(Dial_MainLnk);
		             #endif
								break;						
		case Dial_DNSR1	:	if (ok)
			                           {
                                                         Dial_Stage(Dial_DNSR2);
			                           }   
								break;		
	         case Dial_DNSR2	:	if (ok)
			                           {
                                                          Dial_Stage(Dial_MainLnk); 
			                           }   
								break;							
		case Dial_MainLnk		:		
	    case Dial_AuxLnk	    :	if (failed || error)
								{
									DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;				// try again in 6 seconds
									break;
								} 
								 if (connect) 						
								{   //  below  run once  since  online
								     if(DataDial.Dial_step ==Dial_MainLnk)    //mainlink 
								             rt_kprintf("\r\n连接成功TCP---\r\n");
								     if(DataDial.Dial_step ==Dial_AuxLnk)    //auxlink 	 
								                rt_kprintf("\r\n Aux 连接成功TCP---\r\n");
								   //     1.   登陆成功后相关操作	 
								    // <--  注册状态
								            if(1==JT808Conf_struct.Regsiter_Status)  
								                 DEV_Login.Operate_enable=1;   			 						
									 
								   // connect = true;
								         //  -----  Data  Dial Related ------
									    if((DataDial.Dial_ON)&&(DataDial.Dial_step<Max_DIALSTEP)) 
									    	{
							                            Dial_Stage(Dial_Idle);
										       DataDial.Dial_step_Retry=0;
										       DataDial.Dial_step_RetryTimer=0;  			
									    	}
							              //-----------------------------------
							           //   DataDial.Dial_ON=0; 
								       DataLink_Online=enable;	  
									  DialLink_TimeOut_Clear(); 	  
									  
                                      #ifdef	MULTI_LINK
											   TCP2_ready_dial=1;	   
                                       #endif
									  
                                   //--------------------------------------------------------------------->
									 Dial_Stage(Dial_Idle); //  state  convert   
									 RTC_TimeShow();	
						             }						           
							      //------------------------------------------							
								 break;  
		     case Dial_ISP:
			 	                if (failed || error)
								{
									DataDial.Dial_step_RetryTimer=Dial_Dial_Retry_Time;
									break;
								}
								 if (connect) 
								{
									 Dial_Stage(Dial_Idle); //	In EM310 Mode										
									TCP2_Connect=1;		
									TCP2_sdFlag=1;
									TCP2_ready_dial=0;  
									rt_kprintf("\r\n TCP 连接成功-ISP!\r\n");     
									 DataDial.Dial_ON=0;  // 
									  ISP_running_state=0;
								}							 
								break;		 						
		default 			:	 Dial_Stage(Dial_Idle);
	                                          DataDial.Dial_step_Retry=0;	
								break;
	}
    //-----------
}

void  IMSIcode_Get(void)
{

              if((GSM_PWR.GSM_power_over==1) &&(JT808Conf_struct.password_flag ==1) )
		{
                   IMSIGet.Checkcounter++;
		       if(IMSIGet.Checkcounter>30)     //  15*30=450ms      
		   	{
                          IMSIGet.Checkcounter=0; 
			    if(IMSIGet.Get_state==1)
	               {
	                 rt_hw_gsm_output(IMSI_Check_str);    // 查询 IMSI_CODE 号码 
	                 rt_kprintf(IMSI_Check_str);  
		         }  
			  else 
			   {
			  	   rt_hw_gsm_output(SIM_Check_Str);    // 先检查 SIM 卡的存在
		                 rt_kprintf(SIM_Check_Str);    
			   }
		   	} 
		}  
}

 

void AT(u8 *str)
{
       rt_hw_gsm_output((const char*)str);     
} 
FINSH_FUNCTION_EXPORT(AT, gsm_ATcmd);



void  rt_hw_gsm_init(void)
{

       GPIO_InitTypeDef GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	


      RCC_AHB1PeriphClockCmd( RCC_AHB1Periph_GPIOC|RCC_AHB1Periph_GPIOD, ENABLE );
      RCC_APB1PeriphClockCmd( RCC_APB1Periph_UART4, ENABLE );



/*uart4 管脚设置*/

	/* Configure USART Tx as alternate function  */
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; 
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;  
       GPIO_InitStructure.GPIO_Pin = GSM_TX_PIN| GSM_RX_PIN;
	GPIO_Init( GPIOC, &GPIO_InitStructure );

       GPIO_PinAFConfig(GPIOC, GPIO_PinSource10, GPIO_AF_UART4);
       GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_UART4);   

	

	NVIC_InitStructure.NVIC_IRQChannel = UART4_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 4;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	USART_InitStructure.USART_BaudRate =57600;//115200;   // new M66  57600  
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;  
	USART_Init(UART4, &USART_InitStructure);
	/* Enable USART */
	USART_Cmd(UART4, ENABLE);
	USART_ITConfig( UART4, USART_IT_RXNE, ENABLE );   

			 
